xeecos/ESP32C3-SPI/src/slave_control.c
// Copyright 2015-2021 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "ESP_LOG.h"
#include "esp_private/wifi.h"
#include "slave_control.h"
#include "esp_hosted_config.pb-c.h"
#include "esp_ota_ops.h"

#define MAC_STR_LEN                 17
#define MAC2STR(a)                  (a)[0], (a)[1], (a)[2], (a)[3], (a)[4], (a)[5]
#define MACSTR                      "%02x:%02x:%02x:%02x:%02x:%02x"
#define SUCCESS                     0
#define FAILURE                     -1
#define SSID_LENGTH                 32
#define PASSWORD_LENGTH             64
#define BSSID_LENGTH                19
#define MIN_TX_POWER                8
#define MAX_TX_POWER                84

/* Bits for wifi connect event */
#define WIFI_CONNECTED_BIT          BIT0
#define WIFI_FAIL_BIT               BIT1
#define WIFI_NO_AP_FOUND_BIT        BIT2
#define WIFI_WRONG_PASSWORD_BIT     BIT3
#define WIFI_HOST_REQUEST_BIT       BIT4

#define MAX_STA_CONNECT_ATTEMPTS    3

#define TIMEOUT_IN_MIN              (60*TIMEOUT_IN_SEC)
#define TIMEOUT_IN_HOUR             (60*TIMEOUT_IN_MIN)
#define TIMEOUT                     (2*TIMEOUT_IN_MIN)
#define RESTART_TIMEOUT             (5*TIMEOUT_IN_SEC)

#if CONFIG_ESP_OTA_WORKAROUND
#define OTA_SLEEP_TIME_MS           (40)
#endif

#define MIN_HEARTBEAT_INTERVAL      (10)
#define MAX_HEARTBEAT_INTERVAL      (60*60)

#define mem_free(x)                 \
        {                           \
            if (x) {                \
                free(x);            \
                x = NULL;           \
            }                       \
        }

typedef struct esp_ctrl_msg_cmd {
	int req_num;
	esp_err_t (*command_handler)(CtrlMsg *req,
			CtrlMsg *resp, void *priv_data);
} esp_ctrl_msg_req_t;

// static const char* TAG = "slave_ctrl";
extern volatile uint8_t ota_ongoing;
static TimerHandle_t handle_heartbeat_task;
static uint32_t hb_num;
static bool event_registered = false;

/* FreeRTOS event group to signal when we are connected*/
static EventGroupHandle_t wifi_event_group;

static bool scan_done = false;
static esp_ota_handle_t handle;
const esp_partition_t* update_partition = NULL;
static int ota_msg = 0;

static void station_event_handler(void* arg, esp_event_base_t event_base,
		int32_t event_id, void* event_data);
static void softap_event_handler(void* arg, esp_event_base_t event_base,
		int32_t event_id, void* event_data);
static void ap_scan_list_event_handler(void* arg, esp_event_base_t event_base,
		int32_t event_id, void* event_data);
static void station_event_register(void);
static void softap_event_register(void);
static void softap_event_unregister(void);
static void ap_scan_list_event_register(void);
static void ap_scan_list_event_unregister(void);
static esp_err_t convert_mac_to_bytes(uint8_t *out, char *s);

extern esp_err_t wlan_sta_rx_callback(void *buffer, uint16_t len, void *eb);
extern esp_err_t wlan_ap_rx_callback(void *buffer, uint16_t len, void *eb);
void esp_update_ap_mac(void);

extern volatile uint8_t station_connected;
extern volatile uint8_t softap_started;

/* OTA end timer callback */
void vTimerCallback( TimerHandle_t xTimer )
{
	xTimerDelete(xTimer, 0);
	esp_restart();
}

/* event handler for station connect/disconnect to/from AP */
static void station_event_handler(void *arg, esp_event_base_t event_base,
		int32_t event_id, void *event_data)
{
	/* Please make sure that this callback function is as small as possible */
	wifi_event_sta_disconnected_t * disconnected_event =
		(wifi_event_sta_disconnected_t *) event_data;

	if (event_id == WIFI_EVENT_STA_DISCONNECTED) {

		/* find out reason for failure and
		 * set corresponding event bit */
		if (disconnected_event->reason == WIFI_REASON_NO_AP_FOUND)
			xEventGroupSetBits(wifi_event_group, WIFI_NO_AP_FOUND_BIT);
		else if ((disconnected_event->reason == WIFI_REASON_CONNECTION_FAIL) ||
				(disconnected_event->reason == WIFI_REASON_NOT_AUTHED))
			xEventGroupSetBits(wifi_event_group, WIFI_WRONG_PASSWORD_BIT);
		else
			xEventGroupSetBits(wifi_event_group, WIFI_FAIL_BIT);

		if ( station_connected &&
		     !((WIFI_HOST_REQUEST_BIT & xEventGroupGetBitsFromISR(wifi_event_group)) &
		         WIFI_HOST_REQUEST_BIT)) {
			/* Event should not be triggered if event handler is
			 * called as part of host triggered procedure like sta_disconnect etc
			 **/
			send_event_data_to_host(CTRL_MSG_ID__Event_StationDisconnectFromAP,
					&disconnected_event->reason, 1);
		} else {
			//ESP_LOGI(TAG, "Station not connected. reason: %u\n", disconnected_event->reason);
		}

		/* Mark as station disconnected */
		station_connected = false;

	} else if (event_id == WIFI_EVENT_STA_CONNECTED) {
		xEventGroupSetBits(wifi_event_group, WIFI_CONNECTED_BIT);
	}
}

/* event handler for starting softap */
static void softap_event_handler(void *arg, esp_event_base_t event_base,
		int32_t event_id, void *event_data)
{
	/* Please make sure that this callback function is as small as possible */
	if (event_id == WIFI_EVENT_AP_STACONNECTED) {
		// wifi_event_ap_staconnected_t *event = (wifi_event_ap_staconnected_t *) event_data;
		//ESP_LOGI(TAG, "station "MACSTR" join, AID=%d", MAC2STR(event->mac), event->aid);
	} else if (event_id == WIFI_EVENT_AP_STADISCONNECTED) {
		wifi_event_ap_stadisconnected_t *event = (wifi_event_ap_stadisconnected_t *) event_data;
		//ESP_LOGI(TAG, "station "MACSTR" leave, AID=%d", MAC2STR(event->mac), event->aid);
		send_event_data_to_host(CTRL_MSG_ID__Event_StationDisconnectFromESPSoftAP, event->mac, MAC_LEN);
	} else if (event_id == WIFI_EVENT_AP_START) {
		esp_wifi_internal_reg_rxcb(ESP_IF_WIFI_AP, (wifi_rxcb_t) wlan_ap_rx_callback);
		esp_update_ap_mac();
	} else if (event_id == WIFI_EVENT_AP_STOP) {
		//ESP_LOGI(TAG,"softap stop handler stop");
		esp_wifi_internal_reg_rxcb(ESP_IF_WIFI_AP,NULL);
	}
}

