xeecos/ESP32C3-SPI/src/slave_control.c
	resp_payload->resp = SUCCESS;
	return ESP_OK;
err:
	resp_payload->resp = FAILURE;
	return ESP_OK;
}

/* Function connects to received AP configuration. */
static esp_err_t req_connect_ap_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	char mac_str[BSSID_LENGTH] = "";
	uint8_t mac[MAC_LEN] = {0};
	esp_err_t ret = ESP_OK;
	wifi_config_t *wifi_cfg = NULL;
	CtrlMsgRespConnectAP *resp_payload = NULL;
	EventBits_t bits = {0};
	int retry = 0;

	if (!req || !resp || !req->req_connect_ap) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	resp_payload = (CtrlMsgRespConnectAP *)
		calloc(1,sizeof(CtrlMsgRespConnectAP));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__resp__connect_ap__init (resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_CONNECT_AP;
	resp->resp_connect_ap = resp_payload;

	if (event_registered)
		xEventGroupSetBits(wifi_event_group, WIFI_HOST_REQUEST_BIT);

	if (station_connected) {
		/* As station is already connected, disconnect from the AP
		 * before connecting to requested AP */
		ret = esp_wifi_disconnect();
		if (ret) {
			//ESP_LOGE(TAG, "Failed to disconnect");
			goto err;
		}
		xEventGroupWaitBits(wifi_event_group,
			(WIFI_FAIL_BIT),
			pdFALSE,
			pdFALSE,
			TIMEOUT);
		//ESP_LOGI(TAG, "Disconnected from previously connected AP");
		esp_wifi_internal_reg_rxcb(ESP_IF_WIFI_STA, NULL);
		xEventGroupClearBits(wifi_event_group,
			(WIFI_CONNECTED_BIT | WIFI_FAIL_BIT |
			 WIFI_NO_AP_FOUND_BIT | WIFI_WRONG_PASSWORD_BIT));
		station_connected = false;
	}

	if (softap_started) {
		ret = esp_wifi_set_mode(WIFI_MODE_APSTA);
		//ESP_LOGI(TAG,"softap+station mode set");
	} else {
		ret = esp_wifi_set_mode(WIFI_MODE_STA);
		//ESP_LOGI(TAG,"station mode set");
	}
	if (ret) {
		//ESP_LOGE(TAG,"Failed to set mode");
		goto err;
	}

	wifi_cfg = (wifi_config_t *)calloc(1,sizeof(wifi_config_t));
	if (!wifi_cfg) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		goto err;
	}

	if (req->req_connect_ap->ssid) {
		strncpy((char *)wifi_cfg->sta.ssid, req->req_connect_ap->ssid,
				min(sizeof(wifi_cfg->sta.ssid),
					strlen(req->req_connect_ap->ssid)+1));
	}
	if (req->req_connect_ap->pwd) {
		strncpy((char *)wifi_cfg->sta.password, req->req_connect_ap->pwd,
				min(sizeof(wifi_cfg->sta.password),
					strlen((char *)req->req_connect_ap->pwd)+1));
	}
	if ((req->req_connect_ap->bssid) &&
	    (strlen((char *)req->req_connect_ap->bssid))) {
		ret = convert_mac_to_bytes(wifi_cfg->sta.bssid, req->req_connect_ap->bssid);
		if (ret) {
			//ESP_LOGE(TAG, "Failed to convert BSSID into bytes");
			goto err;
		}
		wifi_cfg->sta.bssid_set = true;
	}
	if (req->req_connect_ap->is_wpa3_supported) {
		wifi_cfg->sta.pmf_cfg.capable = true;
		wifi_cfg->sta.pmf_cfg.required = false;
	}
	if (req->req_connect_ap->listen_interval >= 0) {
		wifi_cfg->sta.listen_interval = req->req_connect_ap->listen_interval;
	}

	ret = esp_wifi_get_mac(ESP_IF_WIFI_STA , mac);
	//ESP_LOGI(TAG,"Get station mac address");
	if (ret) {
		//ESP_LOGE(TAG,"Error in getting MAC of ESP Station %d", ret);
		goto err;
	}
	snprintf(mac_str,BSSID_LENGTH,MACSTR,MAC2STR(mac));
	//ESP_LOGI(TAG,"mac [%s] ", mac_str);

	resp_payload->mac.len = strnlen(mac_str, BSSID_LENGTH);
	if (!resp_payload->mac.len) {
		//ESP_LOGE(TAG, "Invalid MAC address length");
		goto err;
	}
	resp_payload->mac.data = (uint8_t *)strndup(mac_str, BSSID_LENGTH);
	if (!resp_payload->mac.data) {
		//ESP_LOGE(TAG, "Failed to allocate memory for MAC address");
		goto err;
	}

	do {
		ret = esp_wifi_set_config(ESP_IF_WIFI_STA, wifi_cfg);
		if (ret == ESP_ERR_WIFI_PASSWORD) {
			//ESP_LOGE(TAG,"Invalid password");
			goto err;
		} else if (ret){
			//ESP_LOGE(TAG, "Failed to set AP config");
			goto err;
		}

		if(!event_registered) {
			wifi_event_group = xEventGroupCreate();
			station_event_register();
			event_registered = true;
			xEventGroupSetBits(wifi_event_group, WIFI_HOST_REQUEST_BIT);
		}

		ret = esp_wifi_connect();
		if (ret) {
			//ESP_LOGI(TAG, "Failed to connect to SSID:'%s', password:'%s'", req->req_connect_ap->ssid ? req->req_connect_ap->ssid : "(null)", req->req_connect_ap->pwd ? req->req_connect_ap->pwd : "(null)");
		}

		if (event_registered)
			bits = xEventGroupWaitBits(wifi_event_group,
					(WIFI_CONNECTED_BIT | WIFI_FAIL_BIT |
					 WIFI_NO_AP_FOUND_BIT | WIFI_WRONG_PASSWORD_BIT),
					pdFALSE,
					pdFALSE,
					TIMEOUT);
		if (bits & WIFI_CONNECTED_BIT) {
			//ESP_LOGI(TAG, "connected to ap SSID:'%s', password:'%s'", req->req_connect_ap->ssid ? req->req_connect_ap->ssid :"(null)", req->req_connect_ap->pwd ? req->req_connect_ap->pwd :"(null)");
			station_connected = true;
			esp_wifi_internal_reg_rxcb(ESP_IF_WIFI_STA, (wifi_rxcb_t) wlan_sta_rx_callback);
			break;
		} else {
			if (bits & WIFI_NO_AP_FOUND_BIT) {
				//ESP_LOGI(TAG, "No AP available as SSID:'%s'", req->req_connect_ap->ssid ? req->req_connect_ap->ssid : "(null)");
				resp_payload->resp = CTRL__STATUS__No_AP_Found;
			} else if (bits & WIFI_WRONG_PASSWORD_BIT) {
				//ESP_LOGI(TAG, "Password incorrect for SSID:'%s', password:'%s'", req->req_connect_ap->ssid ? req->req_connect_ap->ssid : "(null)", req->req_connect_ap->pwd ? req->req_connect_ap->pwd :"(null)");
				resp_payload->resp = CTRL__STATUS__Connection_Fail;
			} else if (bits & WIFI_FAIL_BIT) {
				//ESP_LOGI(TAG, "Failed to connect to SSID:'%s', password:'%s'", req->req_connect_ap->ssid ? req->req_connect_ap->ssid : "(null)", req->req_connect_ap->pwd ? req->req_connect_ap->pwd : "(null)");
			} else {
				//ESP_LOGE(TAG, "Timeout occured");
			}
			esp_wifi_internal_reg_rxcb(ESP_IF_WIFI_STA, NULL);
		}

		if (event_registered)
			xEventGroupClearBits(wifi_event_group,
					(WIFI_CONNECTED_BIT | WIFI_FAIL_BIT |
					 WIFI_NO_AP_FOUND_BIT | WIFI_WRONG_PASSWORD_BIT));
		retry++;

	}while(retry < MAX_STA_CONNECT_ATTEMPTS);

err:
	if (station_connected) {
		resp_payload->resp = SUCCESS;
	} else {
		mem_free(resp_payload->mac.data);
		resp_payload->mac.len = 0;
		resp_payload->resp = FAILURE;
	}
	mem_free(wifi_cfg);

	if (event_registered)
		xEventGroupClearBits(wifi_event_group,
			(WIFI_CONNECTED_BIT | WIFI_FAIL_BIT | WIFI_HOST_REQUEST_BIT |
			 WIFI_NO_AP_FOUND_BIT | WIFI_WRONG_PASSWORD_BIT));
	return ESP_OK;
}

/* Function sends connected AP's configuration */
static esp_err_t req_get_ap_config_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	credentials_t credentials = {0};
	wifi_ap_record_t *ap_info = NULL;
	CtrlMsgRespGetAPConfig *resp_payload = NULL;
	if (!req || !resp) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	ap_info = (wifi_ap_record_t *)calloc(1,sizeof(wifi_ap_record_t));
	if (!ap_info) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	resp_payload = (CtrlMsgRespGetAPConfig *)
		calloc(1,sizeof(CtrlMsgRespGetAPConfig));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		mem_free(ap_info);
		return ESP_ERR_NO_MEM;
	}

	ctrl_msg__resp__get_apconfig__init (resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_GET_AP_CONFIG;
	resp->resp_get_ap_config = resp_payload;

	if (!station_connected) {
		//ESP_LOGI(TAG,"ESP32 station is not connected with AP, can't get AP config");
		resp_payload->resp = CTRL__STATUS__Not_Connected;
		goto err;
	}

