xeecos/ESP32C3-SPI/src/slave_control.c
	ret = esp_wifi_sta_get_ap_info(ap_info);
	if (ret == ESP_ERR_WIFI_NOT_CONNECT) {
		//ESP_LOGI(TAG,"Disconnected from previously connected AP");
		resp_payload->resp = CTRL__STATUS__Not_Connected;
		goto err;
	} else if (ret) {
		//ESP_LOGE(TAG,"Failed to get AP config %d \n", ret);
		resp_payload->resp = FAILURE;
		goto err;
	}

	snprintf((char *)credentials.bssid,BSSID_LENGTH,MACSTR,MAC2STR(ap_info->bssid));
	if (ap_info->ssid) {
		strncpy((char *)credentials.ssid, (char *)ap_info->ssid,
				min(sizeof(credentials.ssid), strlen((char *)ap_info->ssid)+1));
	}
	credentials.rssi = ap_info->rssi;
	credentials.chnl = ap_info->primary;
	credentials.ecn = ap_info->authmode;
	resp_payload->ssid.len = min(strlen((char *)credentials.ssid)+1,
			sizeof(credentials.ssid));
	if (!resp_payload->ssid.len) {
		//ESP_LOGE(TAG, "Invalid SSID length");
		goto err;
	}
	resp_payload->ssid.data = (uint8_t *)strndup((char *)credentials.ssid,
			min(sizeof(credentials.ssid), strlen((char *)credentials.ssid) + 1));
	if (!resp_payload->ssid.data) {
		//ESP_LOGE(TAG, "Failed to allocate memory for SSID");
		goto err;
	}

	resp_payload->bssid.len = strnlen((char *)credentials.bssid,
			sizeof(credentials.bssid));
	if (!resp_payload->bssid.len) {
		//ESP_LOGE(TAG, "Invalid BSSID length");
		goto err;
	}
	resp_payload->bssid.data = (uint8_t *)strndup((char *)credentials.bssid,
			BSSID_LENGTH);
	if (!resp_payload->bssid.data) {
		//ESP_LOGE(TAG, "Failed to allocate memory for BSSID");
		goto err;
	}

	resp_payload->rssi = credentials.rssi;
	resp_payload->chnl = credentials.chnl;
	resp_payload->sec_prot = credentials.ecn;
	resp_payload->resp = SUCCESS;

err:
	mem_free(ap_info);
	return ESP_OK;
}

/* Functions disconnects from AP. */
static esp_err_t req_disconnect_ap_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	CtrlMsgRespGetStatus *resp_payload = NULL;
	if (!req || !resp) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	resp_payload = (CtrlMsgRespGetStatus *)
		calloc(1,sizeof(CtrlMsgRespGetStatus));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__resp__get_status__init(resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_DISCONNECT_AP;
	resp->resp_disconnect_ap = resp_payload;

	if (!station_connected) {
		//ESP_LOGI(TAG,"ESP32 station is not connected with AP, can't disconnect from AP");
		goto err;
	}

	if (event_registered)
		xEventGroupSetBits(wifi_event_group, WIFI_HOST_REQUEST_BIT);
	ret = esp_wifi_disconnect();
	if (ret) {
		//ESP_LOGE(TAG,"Failed to disconnect");
		goto err;
	}
	if (event_registered)
		xEventGroupWaitBits(wifi_event_group,
			(WIFI_FAIL_BIT),
			pdFALSE,
			pdFALSE,
			TIMEOUT);

	//ESP_LOGI(TAG,"Disconnected from AP");
	resp_payload->resp = SUCCESS;
	station_connected = false;

	if (event_registered)
		xEventGroupClearBits(wifi_event_group,
			(WIFI_CONNECTED_BIT | WIFI_FAIL_BIT | WIFI_HOST_REQUEST_BIT |
			 WIFI_NO_AP_FOUND_BIT | WIFI_WRONG_PASSWORD_BIT));
	return ESP_OK;

err:
	if (event_registered)
		xEventGroupClearBits(wifi_event_group,
			(WIFI_CONNECTED_BIT | WIFI_FAIL_BIT | WIFI_HOST_REQUEST_BIT |
			 WIFI_NO_AP_FOUND_BIT | WIFI_WRONG_PASSWORD_BIT));
	resp_payload->resp = FAILURE;
	return ESP_OK;
}

/* Function returns softap's configuration */
static esp_err_t req_get_softap_config_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	wifi_bandwidth_t get_bw = 0;
	credentials_t credentials = {0};
	wifi_config_t get_conf = {0};
	CtrlMsgRespGetSoftAPConfig *resp_payload = NULL;

	if (!req || !resp) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	resp_payload = (CtrlMsgRespGetSoftAPConfig *)calloc(
			1,sizeof(CtrlMsgRespGetSoftAPConfig));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__resp__get_soft_apconfig__init (resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_GET_SOFTAP_CONFIG;
	resp->resp_get_softap_config = resp_payload;

	if (!softap_started) {
		//ESP_LOGI(TAG,"ESP32 SoftAP mode aren't set, So can't get config");
		goto err;
	}

	ret = esp_wifi_get_config(ESP_IF_WIFI_AP, &get_conf);
	if (ret) {
		//ESP_LOGE(TAG,"Failed to get SoftAP config");
		goto err;
	}

	ret = esp_wifi_get_bandwidth(ESP_IF_WIFI_AP,&get_bw);
	if (ret) {
		//ESP_LOGE(TAG,"Failed to get bandwidth");
		goto err;
	}

	if (get_conf.ap.ssid) {
		strncpy((char *)credentials.ssid,(char *)&get_conf.ap.ssid,
				min(sizeof(credentials.ssid), strlen((char *)&get_conf.ap.ssid)+1));
	}
	if (get_conf.ap.password) {
		strncpy((char *)credentials.pwd,(char *)&get_conf.ap.password,
				min(sizeof(credentials.pwd), strlen((char *)&get_conf.ap.password)+1));
	}
	credentials.chnl = get_conf.ap.channel;
	credentials.max_conn = get_conf.ap.max_connection;
	credentials.ecn = get_conf.ap.authmode;
	credentials.ssid_hidden = get_conf.ap.ssid_hidden;

	resp_payload->ssid.len = strnlen((char *)credentials.ssid,
			sizeof(credentials.ssid));
	if (!resp_payload->ssid.len) {
		//ESP_LOGE(TAG, "Invalid SSID length");
		goto err;
	}
	resp_payload->ssid.data = (uint8_t *)strndup((char *)credentials.ssid,
			min(sizeof(credentials.ssid), strlen((char *)credentials.ssid) + 1));
	if (!resp_payload->ssid.data) {
		//ESP_LOGE(TAG, "Failed to allocate memory for SSID");
		goto err;
	}

	if (credentials.ecn != WIFI_AUTH_OPEN) {
		resp_payload->pwd.len = strnlen((char *)credentials.pwd,
				sizeof(credentials.pwd));
		if (!resp_payload->pwd.len) {
			//ESP_LOGE(TAG, "Invalid password length");
			goto err;
		}
	}

	resp_payload->pwd.data = (uint8_t *)strndup((char *)credentials.pwd,
			min(sizeof(credentials.pwd), strlen((char *)credentials.pwd) + 1));
	if (!resp_payload->pwd.data) {
		//ESP_LOGE(TAG, "Failed to allocate memory for password");
		goto err;
	}
	resp_payload->chnl = credentials.chnl;
	resp_payload->sec_prot = credentials.ecn;
	resp_payload->max_conn = credentials.max_conn;
	resp_payload->ssid_hidden = credentials.ssid_hidden;
	resp_payload->bw = get_bw;
	resp_payload->resp = SUCCESS;
	return ESP_OK;

err:
	resp_payload->resp = FAILURE;
	return ESP_OK;
}

