xeecos/ESP32C3-SPI/src/slave_control.c
/* Function sets softap's configuration */
static esp_err_t req_start_softap_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	char mac_str[BSSID_LENGTH] = "";
	uint8_t mac[MAC_LEN] = {0};
	wifi_config_t *wifi_config = NULL;
	CtrlMsgRespStartSoftAP *resp_payload = NULL;

	if (!req || !resp || !req->req_start_softap) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	wifi_config = (wifi_config_t *)calloc(1,sizeof(wifi_config_t));
	if (!wifi_config) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}

	resp_payload = (CtrlMsgRespStartSoftAP *)
		calloc(1,sizeof(CtrlMsgRespStartSoftAP));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		mem_free(wifi_config);
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__resp__start_soft_ap__init (resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_START_SOFTAP;
	resp->resp_start_softap = resp_payload;

	if ((req->req_start_softap->ssid) &&
	    (strlen(req->req_start_softap->ssid) > SSID_LENGTH)) {
		//ESP_LOGE(TAG, "SoftAP SSID length is more than 32 Bytes");
		goto err;
	}
	if ((req->req_start_softap->sec_prot != CTRL__WIFI_SEC_PROT__Open)
			&& (strlen(req->req_start_softap->pwd) > PASSWORD_LENGTH)) {
		//ESP_LOGE(TAG, "PASSWORD Length is more than 64 Bytes");
		goto err;
	}

	if (station_connected) {
		ret = esp_wifi_set_mode(WIFI_MODE_APSTA);
		//ESP_LOGI(TAG,"station+softap mode set");
	} else {
		ret = esp_wifi_set_mode(WIFI_MODE_AP);
		//ESP_LOGI(TAG,"softap mode set");
	}
	if (ret) {
		//ESP_LOGE(TAG,"Failed to set mode");
		goto err;
	}

	wifi_config->ap.authmode = req->req_start_softap->sec_prot;
	if (wifi_config->ap.authmode != WIFI_AUTH_OPEN) {
		if (req->req_start_softap->pwd) {
			strncpy((char *)wifi_config->ap.password,
					req->req_start_softap->pwd,
					min(sizeof(wifi_config->ap.password),
						strlen(req->req_start_softap->pwd)+1));
		}
	}
	if (req->req_start_softap->ssid) {
		strncpy((char *)wifi_config->ap.ssid,
				req->req_start_softap->ssid,
				min(sizeof(wifi_config->ap.ssid),
					strlen(req->req_start_softap->ssid)+1));
		wifi_config->ap.ssid_len = strlen(req->req_start_softap->ssid);
	}

	wifi_config->ap.channel = req->req_start_softap->chnl;
	wifi_config->ap.max_connection = req->req_start_softap-> max_conn;
	wifi_config->ap.ssid_hidden = req->req_start_softap->ssid_hidden;

	ret = esp_wifi_get_mac(WIFI_IF_AP, mac);
	if (ret) {
		//ESP_LOGE(TAG,"Failed to get MAC address of softap");
		goto err;
	}

	snprintf(mac_str,BSSID_LENGTH,MACSTR,MAC2STR(mac));
	//ESP_LOGI(TAG,"mac [%s] ", mac_str);

	resp_payload->mac.len = strnlen(mac_str, BSSID_LENGTH);
	if (!resp_payload->mac.len) {
		//ESP_LOGE(TAG, "Invalid MAC address length");
		goto err;
	}
	resp_payload->mac.data = (uint8_t *)strndup(mac_str, BSSID_LENGTH);
	if (!resp_payload->mac.data) {
		//ESP_LOGE(TAG, "Failed to allocate memory for MAC address");
		goto err;
	}

	ret = esp_wifi_set_bandwidth(ESP_IF_WIFI_AP,req->req_start_softap->bw);
	if (ret) {
		//ESP_LOGE(TAG,"Failed to set bandwidth");
		goto err;
	}

	//ESP_LOGI(TAG, MACSTR, MAC2STR(mac));

	if (softap_started) {
		softap_event_unregister();
		softap_started = false;
	}
	softap_event_register();
	softap_started = true;

	ret = esp_wifi_set_config(ESP_IF_WIFI_AP, wifi_config);
	if (ret) {
		//ESP_LOGE(TAG,"Failed to set softap config");
		goto err;
	}

	//ESP_LOGI(TAG,"ssid %s pwd %s authmode %d ssid_hidden %d max_conn %d channel %d", wifi_config->ap.ssid, wifi_config->ap.password, wifi_config->ap.authmode, wifi_config->ap.ssid_hidden, wifi_config->ap.max_connection,wifi_config->ap.channel);
	//ESP_LOGI(TAG,"ESP32 SoftAP is avaliable ");
	resp_payload->resp = SUCCESS;
	mem_free(wifi_config);
	return ESP_OK;

err:
	if (softap_started) {
		softap_event_unregister();
		softap_started = false;
	}
	resp_payload->resp = FAILURE;
	mem_free(wifi_config);
	return ESP_OK;
}

/* Function sends scanned list of available APs */
static esp_err_t req_get_ap_scan_list_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	wifi_mode_t mode = 0;
	uint16_t ap_count = 0;
	credentials_t credentials = {0};
	wifi_ap_record_t *ap_info = NULL;
	ScanResult **results = NULL;
	CtrlMsgRespScanResult *resp_payload = NULL;
	wifi_scan_config_t scanConf = {
		.show_hidden = true
	};

	if (!req || !resp) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	resp_payload = (CtrlMsgRespScanResult *)
		calloc(1,sizeof(CtrlMsgRespScanResult));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed To allocate memory");
		return ESP_ERR_NO_MEM;
	}

	ctrl_msg__resp__scan_result__init(resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_SCAN_AP_LIST;
	resp->resp_scan_ap_list = resp_payload;

	ap_scan_list_event_register();
	ret = esp_wifi_get_mode(&mode);
	if (ret) {
		//ESP_LOGE(TAG,"Failed to get wifi mode");
		goto err;
	}

	if ((softap_started) &&
	    ((mode != WIFI_MODE_STA) && (mode != WIFI_MODE_NULL))) {
		ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_APSTA));
		//ESP_LOGI(TAG,"softap+station mode set in scan handler");
	} else {
		ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
		//ESP_LOGI(TAG,"Station mode set in scan handler");
	}

	ret = esp_wifi_scan_start(&scanConf, true);
	if (ret) {
		//ESP_LOGE(TAG,"Failed to start scan start command");
		goto err;
	}
	if (!scan_done) {
		//ESP_LOGE(TAG,"Scanning incomplete");
		goto err;
	}

	ret = esp_wifi_scan_get_ap_num(&ap_count);
	if (ret) {
		//ESP_LOGE(TAG,"Failed to get scan AP number");
		goto err;
	}
	if (!ap_count) {
		//ESP_LOGE(TAG,"No AP available");
		goto err;
	}

	ap_info = (wifi_ap_record_t *)calloc(ap_count,sizeof(wifi_ap_record_t));
	if (!ap_info) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		goto err;
	}

	ret = esp_wifi_scan_get_ap_records(&ap_count,ap_info);
	if (ret) {
		//ESP_LOGE(TAG,"Failed to scan ap records");
		goto err;
	}

	credentials.count = ap_count;

	results = (ScanResult **)
		calloc(credentials.count, sizeof(ScanResult));
	if (!results) {
		//ESP_LOGE(TAG,"Failed To allocate memory");
		goto err;
	}

	resp_payload->entries = results;
	//ESP_LOGI(TAG,"Total APs scanned = %u",ap_count);
	for (int i = 0; i < credentials.count; i++ ) {
		results[i] = (ScanResult *)calloc(1,sizeof(ScanResult));
		if (!results[i]) {
			//ESP_LOGE(TAG,"Failed to allocate memory");
			goto err;
		}
		scan_result__init(results[i]);

		//ESP_LOGI(TAG,"Details of AP no %d",i);

		results[i]->ssid.len = strnlen((char *)ap_info[i].ssid, SSID_LENGTH);


