xeecos/ESP32C3-SPI/src/slave_control.c
	if (!req || !resp || !req->req_set_mac_address ||
	    !req->req_set_mac_address->mac.data) {
		//ESP_LOGE(TAG," Invalid command request");
		return ESP_FAIL;
	}

	resp_payload = (CtrlMsgRespSetMacAddress *)
		calloc(1,sizeof(CtrlMsgRespSetMacAddress));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__resp__set_mac_address__init(resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_SET_MAC_ADDRESS;
	resp->resp_set_mac_address = resp_payload;

	if (req->req_set_mac_address->mac.len > MAC_STR_LEN) {
		//ESP_LOGE(TAG, "MAC address should be in aa:bb:cc:dd:ee:ff format");
		goto err;
	}

	ret = convert_mac_to_bytes(mac, (char *)req->req_set_mac_address->mac.data);
	if (ret) {
		//ESP_LOGE(TAG, "Mac address not recognized from %s", (char *)req->req_set_mac_address->mac.data);
		goto err;
	}

	if (req->req_set_mac_address->mode == WIFI_MODE_STA) {
		interface = WIFI_IF_STA;
	} else if (req->req_set_mac_address->mode == WIFI_MODE_AP) {
		interface = WIFI_IF_AP;
	} else {
		//ESP_LOGE(TAG, "Invalid mode to set MAC address");
		goto err;
	}

	ret = esp_wifi_set_mac(interface, mac);
	if (ret == ESP_ERR_WIFI_MODE) {
		//ESP_LOGE(TAG, "ESP32 mode is different than asked one");
		goto err;
	} else if (ret == ESP_ERR_WIFI_MAC) {
		//ESP_LOGE(TAG, "station and softap interface has same MAC address. OR");
		//ESP_LOGE(TAG, "Invalid MAC Address, The bit 0 of the first byte of ESP32 MAC address can not be 1, For example, the MAC address can set to be 1a:XX:XX:XX:XX:XX, but can not be 15:XX:XX:XX:XX:XX");
		goto err;
	} else if (ret) {
		//ESP_LOGE(TAG, "Failed to set MAC address, error %d ", ret);
		goto err;
	}

	resp_payload->resp = SUCCESS;
	return ESP_OK;

err:
	resp_payload->resp = FAILURE;
	return ESP_OK;
}

/* Function sets power save mode */
static esp_err_t req_set_power_save_mode_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	CtrlMsgRespSetMode *resp_payload = NULL;

	if (!req || !resp || !req->req_set_power_save_mode) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	resp_payload = (CtrlMsgRespSetMode *)calloc(1,sizeof(CtrlMsgRespSetMode));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__resp__set_mode__init(resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_SET_POWER_SAVE_MODE;
	resp->resp_set_power_save_mode = resp_payload;

	/*
	 * WIFI_PS_NONE mode can not use in case of coex i.e. Wi-Fi+BT/BLE.
	 * By default ESP has WIFI_PS_MIN_MODEM power save mode
	 */
	if ((req->req_set_power_save_mode->mode == WIFI_PS_MIN_MODEM) ||
	    (req->req_set_power_save_mode->mode == WIFI_PS_MAX_MODEM)) {
		ret = esp_wifi_set_ps(req->req_set_power_save_mode->mode);
		if (ret) {
			//ESP_LOGE(TAG, "Failed to set power save mode");
			goto err;
		}
	} else {
		//ESP_LOGE(TAG, "Invalid Power Save Mode");
		goto err;
	}

	resp_payload->resp = SUCCESS;
	return ESP_OK;

err:
	resp_payload->resp = FAILURE;
	return ESP_OK;
}

/* Function returns current power save mode */
static esp_err_t req_get_power_save_mode_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	wifi_ps_type_t ps_type = 0;
	CtrlMsgRespGetMode *resp_payload = NULL;

	if (!req || !resp) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	resp_payload = (CtrlMsgRespGetMode *)calloc(1,sizeof(CtrlMsgRespGetMode));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__resp__get_mode__init(resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_GET_POWER_SAVE_MODE;
	resp->resp_get_power_save_mode = resp_payload;

	ret = esp_wifi_get_ps(&ps_type);
	if (ret) {
		//ESP_LOGE(TAG, "Failed to set power save mode");
		resp_payload->resp = FAILURE;
		return ESP_OK;
	} else {
		resp->resp_get_power_save_mode->mode = ps_type;
	}

	resp_payload->resp = SUCCESS;
	return ESP_OK;
}

/* Function OTA begin */
static esp_err_t req_ota_begin_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	CtrlMsgRespOTABegin *resp_payload = NULL;

	if (!req || !resp) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	//ESP_LOGI(TAG, "OTA update started");

	resp_payload = (CtrlMsgRespOTABegin *)
		calloc(1,sizeof(CtrlMsgRespOTABegin));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__resp__otabegin__init(resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_OTA_BEGIN;
	resp->resp_ota_begin = resp_payload;

	/* Identify next OTA partition */
	update_partition = esp_ota_get_next_update_partition(NULL);
	if (update_partition == NULL) {
		//ESP_LOGE(TAG, "Failed to get next update partition");
		goto err;
	}

	//ESP_LOGI(TAG, "Prepare partition for OTA\n");
	ota_ongoing=1;
#if CONFIG_ESP_OTA_WORKAROUND
	vTaskDelay(OTA_SLEEP_TIME_MS/portTICK_PERIOD_MS);
#endif
	ret = esp_ota_begin(update_partition, OTA_SIZE_UNKNOWN, &handle);
	ota_ongoing=0;
	if (ret) {
		//ESP_LOGE(TAG, "OTA update failed in OTA begin");
		goto err;
	}

	ota_msg = 1;

	resp_payload->resp = SUCCESS;
	return ESP_OK;
err:
	resp_payload->resp = FAILURE;
	return ESP_OK;

}

/* Function OTA write */
static esp_err_t req_ota_write_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	CtrlMsgRespOTAWrite *resp_payload = NULL;

	if (!req || !resp) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	resp_payload = (CtrlMsgRespOTAWrite *)calloc(1,sizeof(CtrlMsgRespOTAWrite));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}

	if (ota_msg) {
		//ESP_LOGI(TAG, "Flashing image\n");
		ota_msg = 0;
	}
	ctrl_msg__resp__otawrite__init(resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_OTA_WRITE;
	resp->resp_ota_write = resp_payload;

	ota_ongoing=1;
#if CONFIG_ESP_OTA_WORKAROUND
	/* Delay added is to give chance to transfer pending data at transport
	 * Care to be taken, when OTA ongoing, no other processing should happen
	 * So big sleep is added before any flash operations start
	 * */
	vTaskDelay(OTA_SLEEP_TIME_MS/portTICK_PERIOD_MS);
#endif
	printf(".");
	fflush(stdout);
	ret = esp_ota_write( handle, (const void *)req->req_ota_write->ota_data.data,
			req->req_ota_write->ota_data.len);
	ota_ongoing=0;
	if (ret != ESP_OK) {
		//ESP_LOGE(TAG, "OTA write failed with return code 0x%x",ret);
		resp_payload->resp = FAILURE;
		return ESP_OK;
	}
	resp_payload->resp = SUCCESS;
	return ESP_OK;
}

/* Function OTA end */
static esp_err_t req_ota_end_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	CtrlMsgRespOTAEnd *resp_payload = NULL;
	TimerHandle_t xTimer = NULL;

	if (!req || !resp) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	resp_payload = (CtrlMsgRespOTAEnd *)calloc(1,sizeof(CtrlMsgRespOTAEnd));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__resp__otaend__init(resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_OTA_END;
	resp->resp_ota_end = resp_payload;

	ota_ongoing=1;
#if CONFIG_ESP_OTA_WORKAROUND
	vTaskDelay(OTA_SLEEP_TIME_MS/portTICK_PERIOD_MS);
#endif
	ret = esp_ota_end(handle);
	ota_ongoing=0;
	if (ret != ESP_OK) {
		if (ret == ESP_ERR_OTA_VALIDATE_FAILED) {
			//ESP_LOGE(TAG, "Image validation failed, image is corrupted");
		} else {
			//ESP_LOGE(TAG, "OTA update failed in end (%s)!", esp_err_to_name(ret));
		}
		goto err;
	}

	/* set OTA partition for next boot */
	ret = esp_ota_set_boot_partition(update_partition);
	if (ret != ESP_OK) {
		//ESP_LOGE(TAG, "esp_ota_set_boot_partition failed (%s)!", esp_err_to_name(ret));
		goto err;
	}
	xTimer = xTimerCreate("Timer", RESTART_TIMEOUT , pdFALSE, 0, vTimerCallback);
	if (xTimer == NULL) {
		//ESP_LOGE(TAG, "Failed to create timer to restart system");
		goto err;
	}
	ret = xTimerStart(xTimer, 0);
	if (ret != pdPASS) {
		//ESP_LOGE(TAG, "Failed to start timer to restart system");
		goto err;
	}
	//ESP_LOGE(TAG, "**** OTA updated successful, ESP32 will reboot in 5 sec ****");
	resp_payload->resp = SUCCESS;
	return ESP_OK;
err:
	resp_payload->resp = FAILURE;
	return ESP_OK;
}

/* Function vendor specific ie */
static esp_err_t req_set_softap_vender_specific_ie_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	CtrlMsgRespSetSoftAPVendorSpecificIE *resp_payload = NULL;
	CtrlMsgReqSetSoftAPVendorSpecificIE *p_vsi = req->req_set_softap_vendor_specific_ie;
	CtrlMsgReqVendorIEData *p_vid = NULL;
	vendor_ie_data_t *v_data = NULL;

	if (!req || !resp || !p_vsi) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}
	p_vid = p_vsi->vendor_ie_data;

