xeecos/ESP32C3-SPI/src/slave_control.c
	if (!p_vsi->enable) {

		//ESP_LOGI(TAG,"Disable softap vendor IE\n");

	} else {

		//ESP_LOGI(TAG,"Enable softap vendor IE\n");

		if (!p_vid ||
		    !p_vid->payload.len ||
		    !p_vid->payload.data) {
			//ESP_LOGE(TAG, "Invalid parameters");
			return ESP_FAIL;
		}

		v_data = (vendor_ie_data_t*)calloc(1,sizeof(vendor_ie_data_t)+p_vid->payload.len);
		if (!v_data) {
			//ESP_LOGE(TAG, "Malloc failed at %s:%u\n", __func__, __LINE__);
			return ESP_FAIL;
		}

		v_data->length = p_vid->length;
		v_data->element_id = p_vid->element_id;
		v_data->vendor_oui_type = p_vid->vendor_oui_type;

		memcpy(v_data->vendor_oui, p_vid->vendor_oui.data, VENDOR_OUI_BUF);

		if (p_vid->payload.len && p_vid->payload.data) {
			memcpy(v_data->payload, p_vid->payload.data, p_vid->payload.len);
		}
	}


	resp_payload = (CtrlMsgRespSetSoftAPVendorSpecificIE *)
		calloc(1,sizeof(CtrlMsgRespSetSoftAPVendorSpecificIE));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		if (v_data)
			mem_free(v_data);
		return ESP_ERR_NO_MEM;
	}

	ctrl_msg__resp__set_soft_apvendor_specific_ie__init(resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_SET_SOFTAP_VENDOR_SPECIFIC_IE;
	resp->resp_set_softap_vendor_specific_ie = resp_payload;


	ret = esp_wifi_set_vendor_ie(p_vsi->enable,
			p_vsi->type,
			p_vsi->idx,
			v_data);

	if (v_data)
		mem_free(v_data);

	if (ret != ESP_OK) {
		//ESP_LOGE(TAG, "Failed to set vendor information element %d \n", ret);
		resp_payload->resp = FAILURE;
		return ESP_OK;
	}
	resp_payload->resp = SUCCESS;
	return ESP_OK;
}

/* Function set wifi maximum TX power */
static esp_err_t req_set_wifi_max_tx_power_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	CtrlMsgRespSetWifiMaxTxPower *resp_payload = NULL;

	if (!req || !resp ) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	resp_payload = (CtrlMsgRespSetWifiMaxTxPower *)
		calloc(1,sizeof(CtrlMsgRespSetWifiMaxTxPower));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__resp__set_wifi_max_tx_power__init(resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_SET_WIFI_MAX_TX_POWER;
	resp->resp_set_wifi_max_tx_power = resp_payload;

	if ((req->req_set_wifi_max_tx_power->wifi_max_tx_power > MAX_TX_POWER)
			|| (req->req_set_wifi_max_tx_power->wifi_max_tx_power < MIN_TX_POWER)) {
		//ESP_LOGE(TAG, "Invalid maximum transmitting power value");
		//ESP_LOGE(TAG, "Value lies between [8,84]");
		//ESP_LOGE(TAG, "Please refer `wifi_set_max_tx_power` API documentation \n");
		resp_payload->resp = CTRL__STATUS__Out_Of_Range;
		return ESP_OK;
	}

	ret = esp_wifi_set_max_tx_power(req->req_set_wifi_max_tx_power->wifi_max_tx_power);
	if (ret != SUCCESS) {
		//ESP_LOGE(TAG, "Failed to set TX power");
		goto err;
	}
	resp_payload->resp = SUCCESS;
	return ESP_OK;
err:
	resp_payload->resp = FAILURE;
	return ESP_OK;
}

/* Function get wifi TX current power */
static esp_err_t req_get_wifi_curr_tx_power_handler (CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	int8_t power = 0;
	CtrlMsgRespGetWifiCurrTxPower *resp_payload = NULL;

	if (!req || !resp) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	resp_payload = (CtrlMsgRespGetWifiCurrTxPower *)
		calloc(1,sizeof(CtrlMsgRespGetWifiCurrTxPower));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}

	ctrl_msg__resp__get_wifi_curr_tx_power__init(resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_GET_WIFI_CURR_TX_POWER;
	resp->resp_get_wifi_curr_tx_power = resp_payload;

	ret = esp_wifi_get_max_tx_power(&power);
	if (ret != SUCCESS) {
		//ESP_LOGE(TAG, "Failed to get TX power");
		goto err;
	}
	resp_payload->wifi_curr_tx_power = power;
	resp_payload->resp = SUCCESS;
	return ESP_OK;
err:
	resp_payload->resp = FAILURE;
	return ESP_OK;
}

static void heartbeat_timer_cb(TimerHandle_t xTimer)
{
	send_event_to_host(CTRL_MSG_ID__Event_Heartbeat);
	hb_num++;
}

static void stop_heartbeat(void)
{
	if (handle_heartbeat_task &&
	    xTimerIsTimerActive(handle_heartbeat_task)) {
		//ESP_LOGI(TAG, "Stopping HB timer");
		xTimerStop(handle_heartbeat_task, portMAX_DELAY);
		xTimerDelete(handle_heartbeat_task, portMAX_DELAY);
		handle_heartbeat_task = NULL;
	}
	hb_num = 0;
}

static esp_err_t start_heartbeat(int duration)
{
	esp_err_t ret = ESP_OK;

	handle_heartbeat_task = xTimerCreate("HB_Timer",
			duration*TIMEOUT_IN_SEC, pdTRUE, 0, heartbeat_timer_cb);
	if (handle_heartbeat_task == NULL) {
		//ESP_LOGE(TAG, "Failed to Heartbeat");
		return ESP_FAIL;
	}

	ret = xTimerStart(handle_heartbeat_task, 0);
	if (ret != pdPASS) {
		//ESP_LOGE(TAG, "Failed to start Heartbeat");
		return ESP_FAIL;
	}
	//ESP_LOGI(TAG, "HB timer started for %u sec\n", duration);

	return ESP_OK;
}

static esp_err_t configure_heartbeat(bool enable, int hb_duration)
{
	esp_err_t ret = ESP_OK;
	int duration = hb_duration ;

	if (!enable) {
		//ESP_LOGI(TAG, "Stop Heatbeat");
		stop_heartbeat();

	} else {
		if (duration < MIN_HEARTBEAT_INTERVAL)
			duration = MIN_HEARTBEAT_INTERVAL;
		if (duration > MAX_HEARTBEAT_INTERVAL)
			duration = MAX_HEARTBEAT_INTERVAL;

		stop_heartbeat();

		ret = start_heartbeat(duration);
	}

	return ret;
}
/* Function to config heartbeat */
static esp_err_t req_config_heartbeat(CtrlMsg *req,
		CtrlMsg *resp, void *priv_data)
{
	esp_err_t ret = ESP_OK;
	CtrlMsgRespConfigHeartbeat *resp_payload = NULL;

	if (!req || !resp) {
		//ESP_LOGE(TAG, "Invalid parameters");
		return ESP_FAIL;
	}

	resp_payload = (CtrlMsgRespConfigHeartbeat*)
		calloc(1,sizeof(CtrlMsgRespConfigHeartbeat));
	if (!resp_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}

	ctrl_msg__resp__config_heartbeat__init(resp_payload);
	resp->payload_case = CTRL_MSG__PAYLOAD_RESP_CONFIG_HEARTBEAT;
	resp->resp_config_heartbeat = resp_payload;

	ret = configure_heartbeat(req->req_config_heartbeat->enable,
			req->req_config_heartbeat->duration);
	if (ret != SUCCESS) {
		//ESP_LOGE(TAG, "Failed to set heartbeat");
		goto err;
	}
	resp_payload->resp = SUCCESS;
	return ESP_OK;
err:
	resp_payload->resp = FAILURE;
	return ESP_OK;
}

static esp_ctrl_msg_req_t req_table[] = {
	{
		.req_num = CTRL_MSG_ID__Req_GetMACAddress ,
		.command_handler = req_get_mac_address_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_GetWifiMode,
		.command_handler = req_get_wifi_mode_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_SetWifiMode,
		.command_handler = req_set_wifi_mode_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_GetAPConfig ,
		.command_handler = req_get_ap_config_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_ConnectAP ,
		.command_handler = req_connect_ap_handler
	},
	{
		.req_num =  CTRL_MSG_ID__Req_GetSoftAPConfig ,
		.command_handler = req_get_softap_config_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_StartSoftAP ,
		.command_handler = req_start_softap_handler
	},
	{
		.req_num =  CTRL_MSG_ID__Req_DisconnectAP ,
		.command_handler = req_disconnect_ap_handler
	},
	{
		.req_num =  CTRL_MSG_ID__Req_StopSoftAP ,
		.command_handler = req_stop_softap_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_GetAPScanList ,
		.command_handler = req_get_ap_scan_list_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_GetSoftAPConnectedSTAList ,
		.command_handler = get_connected_sta_list_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_SetMacAddress,
		.command_handler = req_set_mac_address_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_SetPowerSaveMode,
		.command_handler = req_set_power_save_mode_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_GetPowerSaveMode,
		.command_handler = req_get_power_save_mode_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_OTABegin,
		.command_handler = req_ota_begin_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_OTAWrite,
		.command_handler = req_ota_write_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_OTAEnd,
		.command_handler = req_ota_end_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_SetSoftAPVendorSpecificIE,
		.command_handler = req_set_softap_vender_specific_ie_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_SetWifiMaxTxPower,
		.command_handler = req_set_wifi_max_tx_power_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_GetWifiCurrTxPower,
		.command_handler = req_get_wifi_curr_tx_power_handler
	},
	{
		.req_num = CTRL_MSG_ID__Req_ConfigHeartbeat,
		.command_handler = req_config_heartbeat
	},
};


