xeecos/ESP32C3-SPI/src/slave_control.c
static int lookup_req_handler(int req_id)
{
	for (int i = 0; i < sizeof(req_table)/sizeof(esp_ctrl_msg_req_t); i++) {
		if (req_table[i].req_num == req_id) {
			return i;
		}
	}
	return -1;
}

static esp_err_t esp_ctrl_msg_command_dispatcher(
		CtrlMsg *req, CtrlMsg *resp,
		void *priv_data)
{
	esp_err_t ret = ESP_OK;
	int req_index = 0;

	if (!req || !resp) {
		//ESP_LOGE(TAG, "Invalid parameters in command");
		return ESP_FAIL;
	}

	if ((req->msg_id <= CTRL_MSG_ID__Req_Base) ||
		(req->msg_id >= CTRL_MSG_ID__Req_Max)) {
		//ESP_LOGE(TAG, "Invalid command request lookup");
	}

	req_index = lookup_req_handler(req->msg_id);
	if (req_index < 0) {
		//ESP_LOGE(TAG, "Invalid command handler lookup");
		return ESP_FAIL;
	}

	ret = req_table[req_index].command_handler(req, resp, priv_data);
	if (ret) {
		//ESP_LOGE(TAG, "Error executing command handler");
		return ESP_FAIL;
	}

	return ESP_OK;
}

static void esp_ctrl_msg_cleanup(CtrlMsg *resp)
{
	if (!resp) {
		return;
	}

	switch (resp->msg_id) {
		case (CTRL_MSG_ID__Resp_GetMACAddress ) : {
			mem_free(resp->resp_get_mac_address->mac.data);
			mem_free(resp->resp_get_mac_address);
			break;
		} case (CTRL_MSG_ID__Resp_GetWifiMode) : {
			mem_free(resp->resp_get_wifi_mode);
			break;
		} case (CTRL_MSG_ID__Resp_SetWifiMode ) : {
			mem_free(resp->resp_set_wifi_mode);
			break;
		} case (CTRL_MSG_ID__Resp_GetAPConfig ) : {
			mem_free(resp->resp_get_ap_config->ssid.data);
			mem_free(resp->resp_get_ap_config->bssid.data);
			mem_free(resp->resp_get_ap_config);
			break;
		} case (CTRL_MSG_ID__Resp_ConnectAP ) : {
			mem_free(resp->resp_connect_ap->mac.data);
			mem_free(resp->resp_connect_ap);
			break;
		} case (CTRL_MSG_ID__Resp_GetSoftAPConfig ) : {
			mem_free(resp->resp_get_softap_config->ssid.data);
			mem_free(resp->resp_get_softap_config->pwd.data);
			mem_free(resp->resp_get_softap_config);
			break;
		} case (CTRL_MSG_ID__Resp_StartSoftAP ) : {
			mem_free(resp->resp_start_softap->mac.data);
			mem_free(resp->resp_start_softap);
			break;
		} case (CTRL_MSG_ID__Resp_DisconnectAP ) : {
			mem_free(resp->resp_disconnect_ap);
			break;
		} case (CTRL_MSG_ID__Resp_StopSoftAP ) : {
			mem_free(resp->resp_stop_softap);
			break;
		} case (CTRL_MSG_ID__Resp_GetAPScanList) : {
			if (resp->resp_scan_ap_list) {
				if (resp->resp_scan_ap_list->entries) {
					for (int i=0 ; i<resp->resp_scan_ap_list->n_entries; i++) {
						if (resp->resp_scan_ap_list->entries[i]) {
							if (resp->resp_scan_ap_list->entries[i]->ssid.data) {
								mem_free(resp->resp_scan_ap_list->entries[i]->ssid.data);
							}
							if (resp->resp_scan_ap_list->entries[i]->bssid.data) {
								mem_free(resp->resp_scan_ap_list->entries[i]->bssid.data);
							}
							mem_free(resp->resp_scan_ap_list->entries[i]);
						}
				   }
					mem_free(resp->resp_scan_ap_list->entries);
				}
				mem_free(resp->resp_scan_ap_list);
			}
			break;
		} case (CTRL_MSG_ID__Resp_GetSoftAPConnectedSTAList ) : {
			if (resp->resp_softap_connected_stas_list) {
				if (resp->resp_softap_connected_stas_list->stations) {
					for (int i=0 ; i < resp->resp_softap_connected_stas_list->num; i++) {
						if (resp->resp_softap_connected_stas_list->stations[i]) {
							if (resp->resp_softap_connected_stas_list->stations[i]->mac.data) {
								mem_free(resp->resp_softap_connected_stas_list->stations[i]->mac.data);
							}
							mem_free(resp->resp_softap_connected_stas_list->stations[i]);
						}
					}
					mem_free(resp->resp_softap_connected_stas_list->stations);
				}
				mem_free(resp->resp_softap_connected_stas_list);
			}
			break;
		} case (CTRL_MSG_ID__Resp_SetMacAddress) : {
			mem_free(resp->resp_set_mac_address);
			break;
		} case (CTRL_MSG_ID__Resp_SetPowerSaveMode) : {
			mem_free(resp->resp_set_power_save_mode);
			break;
		} case (CTRL_MSG_ID__Resp_GetPowerSaveMode) : {
			mem_free(resp->resp_get_power_save_mode);
			break;
		} case (CTRL_MSG_ID__Resp_OTABegin) : {
			mem_free(resp->resp_ota_begin);
			break;
		} case (CTRL_MSG_ID__Resp_OTAWrite) : {
			mem_free(resp->resp_ota_write);
			break;
		} case (CTRL_MSG_ID__Resp_OTAEnd) : {
			mem_free(resp->resp_ota_end);
			break;
		} case (CTRL_MSG_ID__Resp_SetSoftAPVendorSpecificIE) : {
			mem_free(resp->resp_set_softap_vendor_specific_ie);
			break;
		} case (CTRL_MSG_ID__Resp_SetWifiMaxTxPower) : {
			mem_free(resp->resp_set_wifi_max_tx_power);
			break;
		} case (CTRL_MSG_ID__Resp_GetWifiCurrTxPower) : {
			mem_free(resp->resp_get_wifi_curr_tx_power);
			break;
		} case (CTRL_MSG_ID__Resp_ConfigHeartbeat) : {
			mem_free(resp->resp_config_heartbeat);
			break;
		} case (CTRL_MSG_ID__Event_ESPInit) : {
			mem_free(resp->event_esp_init);
			break;
		} case (CTRL_MSG_ID__Event_Heartbeat) : {
			mem_free(resp->event_heartbeat);
			break;
		} case (CTRL_MSG_ID__Event_StationDisconnectFromAP) : {
			mem_free(resp->event_station_disconnect_from_ap);
			break;
		} case (CTRL_MSG_ID__Event_StationDisconnectFromESPSoftAP) : {
			mem_free(resp->event_station_disconnect_from_esp_softap);
			break;
		} default: {
			//ESP_LOGE(TAG, "Unsupported CtrlMsg type[%u]",resp->msg_id);
			break;
		}
	}
}

esp_err_t data_transfer_handler(uint32_t session_id,const uint8_t *inbuf,
		ssize_t inlen, uint8_t **outbuf, ssize_t *outlen, void *priv_data)
{
	CtrlMsg *req = NULL, resp = {0};
	esp_err_t ret = ESP_OK;

	if (!inbuf || !outbuf || !outlen) {
		//ESP_LOGE(TAG,"Buffers are NULL");
		return ESP_FAIL;
	}

	req = ctrl_msg__unpack(NULL, inlen, inbuf);
	if (!req) {
		//ESP_LOGE(TAG, "Unable to unpack config data");
		return ESP_FAIL;
	}

	ctrl_msg__init (&resp);
	resp.msg_type = CTRL_MSG_TYPE__Resp;
	resp.msg_id = req->msg_id - CTRL_MSG_ID__Req_Base + CTRL_MSG_ID__Resp_Base;
	ret = esp_ctrl_msg_command_dispatcher(req,&resp,NULL);
	if (ret) {
		//ESP_LOGE(TAG, "Command dispatching not happening");
		goto err;
	}

	ctrl_msg__free_unpacked(req, NULL);

	*outlen = ctrl_msg__get_packed_size (&resp);
	if (*outlen <= 0) {
		//ESP_LOGE(TAG, "Invalid encoding for response");
		goto err;
	}

	*outbuf = (uint8_t *)calloc(1, *outlen);
	if (!*outbuf) {
		//ESP_LOGE(TAG, "No memory allocated for outbuf");
		esp_ctrl_msg_cleanup(&resp);
		return ESP_ERR_NO_MEM;
	}

	ctrl_msg__pack (&resp, *outbuf);
	esp_ctrl_msg_cleanup(&resp);
	return ESP_OK;

err:
	esp_ctrl_msg_cleanup(&resp);
	return ESP_FAIL;
}

