xeecos/ESP32C3-SPI/src/slave_control.c
/* Function ESPInit Notification */
static esp_err_t ctrl_ntfy_ESPInit(CtrlMsg *ntfy)
{
	CtrlMsgEventESPInit *ntfy_payload = NULL;

	//ESP_LOGI(TAG,"event ESPInit");
	ntfy_payload = (CtrlMsgEventESPInit *)
		calloc(1,sizeof(CtrlMsgEventESPInit));
	if (!ntfy_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__event__espinit__init(ntfy_payload);
	ntfy->payload_case = CTRL_MSG__PAYLOAD_EVENT_ESP_INIT;
	ntfy->event_esp_init = ntfy_payload;

	return ESP_OK;
}

static esp_err_t ctrl_ntfy_heartbeat(CtrlMsg *ntfy)
{
	CtrlMsgEventHeartbeat *ntfy_payload = NULL;


	ntfy_payload = (CtrlMsgEventHeartbeat*)
		calloc(1,sizeof(CtrlMsgEventHeartbeat));
	if (!ntfy_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__event__heartbeat__init(ntfy_payload);

	ntfy_payload->hb_num = hb_num;

	ntfy->payload_case = CTRL_MSG__PAYLOAD_EVENT_HEARTBEAT;
	ntfy->event_heartbeat = ntfy_payload;

	return ESP_OK;

}

static esp_err_t ctrl_ntfy_StationDisconnectFromAP(CtrlMsg *ntfy,
		const uint8_t *data, ssize_t len)
{
	CtrlMsgEventStationDisconnectFromAP *ntfy_payload = NULL;

	ntfy_payload = (CtrlMsgEventStationDisconnectFromAP*)
		calloc(1,sizeof(CtrlMsgEventStationDisconnectFromAP));
	if (!ntfy_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__event__station_disconnect_from_ap__init(ntfy_payload);

	ntfy->payload_case = CTRL_MSG__PAYLOAD_EVENT_STATION_DISCONNECT_FROM__AP;
	ntfy->event_station_disconnect_from_ap = ntfy_payload;

	ntfy_payload->resp = *data;

	return ESP_OK;

}

static esp_err_t ctrl_ntfy_StationDisconnectFromESPSoftAP(CtrlMsg *ntfy,
		const uint8_t *data, ssize_t len)
{
	char mac_str[BSSID_LENGTH] = "";
	CtrlMsgEventStationDisconnectFromESPSoftAP *ntfy_payload = NULL;

	ntfy_payload = (CtrlMsgEventStationDisconnectFromESPSoftAP*)
		calloc(1,sizeof(CtrlMsgEventStationDisconnectFromESPSoftAP));
	if (!ntfy_payload) {
		//ESP_LOGE(TAG,"Failed to allocate memory");
		return ESP_ERR_NO_MEM;
	}
	ctrl_msg__event__station_disconnect_from_espsoft_ap__init(ntfy_payload);

	ntfy->payload_case = CTRL_MSG__PAYLOAD_EVENT_STATION_DISCONNECT_FROM__ESP__SOFT_AP;
	ntfy->event_station_disconnect_from_esp_softap = ntfy_payload;

	snprintf(mac_str, BSSID_LENGTH, MACSTR, MAC2STR(data));
	ntfy_payload->mac.len = strnlen(mac_str, BSSID_LENGTH);
	//ESP_LOGI(TAG,"mac [%s]\n", mac_str);

	ntfy_payload->mac.data = (uint8_t *)strndup(mac_str, ntfy_payload->mac.len);
	if (!ntfy_payload->mac.data) {
		//ESP_LOGE(TAG, "Failed to allocate sta disconnect from softap");
		goto err;
	}

	ntfy_payload->resp = SUCCESS;
	return ESP_OK;
err:
	ntfy_payload->resp = FAILURE;
	return ESP_OK;
}

esp_err_t ctrl_notify_handler(uint32_t session_id,const uint8_t *inbuf,
		ssize_t inlen, uint8_t **outbuf, ssize_t *outlen, void *priv_data)
{
	CtrlMsg ntfy = {0};
	int ret = SUCCESS;

	if (!outbuf || !outlen) {
		//ESP_LOGE(TAG,"Buffers are NULL");
		return ESP_FAIL;
	}

	ctrl_msg__init (&ntfy);
	ntfy.msg_id = session_id;
	ntfy.msg_type = CTRL_MSG_TYPE__Event;

	switch (ntfy.msg_id) {
		case CTRL_MSG_ID__Event_ESPInit : {
			ret = ctrl_ntfy_ESPInit(&ntfy);
			break;
		} case CTRL_MSG_ID__Event_Heartbeat: {
			ret = ctrl_ntfy_heartbeat(&ntfy);
			break;
		} case CTRL_MSG_ID__Event_StationDisconnectFromAP: {
			ret = ctrl_ntfy_StationDisconnectFromAP(&ntfy, inbuf, inlen);
			break;
		} case CTRL_MSG_ID__Event_StationDisconnectFromESPSoftAP: {
			ret = ctrl_ntfy_StationDisconnectFromESPSoftAP(&ntfy, inbuf, inlen);
			break;
		} default: {
			//ESP_LOGE(TAG, "Incorrect/unsupported Ctrl Notification[%u]\n",ntfy.msg_id);
			goto err;
			break;
		}
	}

	if (ret) {
		//ESP_LOGI(TAG, "notification[%u] not sent\n", ntfy.msg_id);
		goto err;
	}

	*outlen = ctrl_msg__get_packed_size (&ntfy);
	if (*outlen <= 0) {
		//ESP_LOGE(TAG, "Invalid encoding for notify");
		goto err;
	}

	*outbuf = (uint8_t *)calloc(1, *outlen);
	if (!*outbuf) {
		//ESP_LOGE(TAG, "No memory allocated for outbuf");
		esp_ctrl_msg_cleanup(&ntfy);
		return ESP_ERR_NO_MEM;
	}

	ctrl_msg__pack (&ntfy, *outbuf);
	esp_ctrl_msg_cleanup(&ntfy);
	return ESP_OK;

err:
	if (!*outbuf) {
		free(*outbuf);
		*outbuf = NULL;
	}
	esp_ctrl_msg_cleanup(&ntfy);
	return ESP_FAIL;
}
